БухЭксп/Catalogs/CW_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецПраваДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиПользователей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (НЕ Объект.Ссылка.Пустая()) Тогда
		
		ТекущийПользователь = CW_Настройки.Пользователь();
		Если (ТекущийПользователь <> Объект.Пользователь) 
			И НЕ Пользователи.ЭтоПолноправныйПользователь(,Истина) Тогда
			
			ЭтаФорма.ТолькоПросмотр 					= Истина;
			Элементы.Родитель.Доступность 				= Ложь;
			Элементы.ГруппаОбщийДоступ.Доступность		= Ложь;
			Элементы.ОграничениеДоступа.Доступность 	= Ложь;
			Элементы.ФормаЗагрузитьИзФайла.Доступность 	= Ложь;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элементы.ФормаСохранитьВФайл.Видимость = (НЕ Объект.Ссылка.Пустая());
	Элементы.ФормаЗагрузитьИзФайла.Видимость = (НЕ Объект.Ссылка.Пустая());
	
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.ГруппаОбщийДоступ.Видимость = Элементы.ГруппаОбщийДоступ.Доступность;
	// --- 
	Элементы.ОграничениеДоступа.Видимость = Объект.ОбщаяНастройка;
	Элементы.ПраваДоступа.Видимость = Объект.ОграничениеДоступа;
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ОбщаяНастройкаПриИзменении(Элемент)
	
	Если (НЕ Объект.ОбщаяНастройка) Тогда
		Объект.ОграничениеДоступа = Ложь;
		Объект.ПраваДоступа.Очистить();
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ОграничениеДоступаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступаВладелецПраваДоступаПриИзменении(Элемент)
	ПраваДоступаВладелецПраваДоступаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПраваДоступаВладелецПраваДоступаПриИзмененииНаСервере()
	
	Для каждого Стр Из Объект.ПраваДоступа Цикл
		
		Если ((ТипЗнч(Стр.ВладелецПраваДоступа)=Тип("СправочникСсылка.Пользователи"))) Тогда
			Стр.ИндексКартинки = 1;	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	СФ = _ПолучитьСтруктураФайла();
	// --- 
	МассивПередаваемыхФайлов = Новый Массив;
	МассивПередаваемыхФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(СФ.Имя,СФ.Адрес));
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаСохраненияФайлаНастройки",ЭтотОбъект, Новый Структура()); 
	НачатьПолучениеФайлов(ПОВ,МассивПередаваемыхФайлов,,Истина);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьСтруктураФайла()
	// --- 
	
	Настройка = Объект.Ссылка.Настройка.Получить();
	СтрокаНастройки = ЗначениеВСтрокуВнутр(Настройка);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ls");
	// --- 
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.ДобавитьСтроку(СтрокаНастройки);
	ТекстовыйФайл.Записать(ИмяВременногоФайла,КодировкаТекста.UTF8);
	// --- 
	ДД = Новый ДвоичныеДанные(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	АдресФайла = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
	// --- 
	СФ = Новый Структура("Адрес,Имя",АдресФайла,Объект.Наименование+".ls");
	// --- 
	Возврат(СФ);
	
	// --- 
КонецФункции
 
&НаКлиенте
Процедура ОбработкаСохраненияФайлаНастройки(ПолученныеФайлы, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ПолученныеФайлы <> Неопределено) Тогда
		
		Состояние("Файл настройки сохранён.");
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораФайлаНастройки",ЭтотОбъект, Новый Структура()); 
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = "Выберите файл настройки";
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Настройка списка'; en = 'List settings'") + "(*.ls)|*.ls";
	// --- 
	ДиалогВыбораФайла.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаНастройки(Файлы, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Файлы <> Неопределено) Тогда
		
		Если (Файлы.Количество() <> 0) Тогда
			
			ПередатьФайлНастройкиНаСервер(Файлы[0]);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПередатьФайлНастройкиНаСервер(Файл)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайлаНаСервер",ЭтотОбъект, Новый Структура()); 
	НачатьПомещениеФайла(ПОВ,,Файл,Ложь,ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайлаНаСервер(Результат,Адрес,ИмяФайла, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат <> Неопределено) Тогда
		
		Если (Результат) Тогда
			
			Ответ = _ПрочитатьНастройкуНаСервере(Адрес);
			Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
				Прочитать();
			Иначе
				ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПрочитатьНастройкуНаСервере(АдресФайлаНастройки)
	// --- 
	
	Попытка
		
		ДД = ПолучитьИзВременногоХранилища(АдресФайлаНастройки);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ls");
		ДД.Записать(ИмяВременногоФайла);
		// --- 
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайла,КодировкаТекста.UTF8);
		СтрокаНастройки = ТекстовыйДокумент.ПолучитьТекст();
		СтруктураНастройки = ЗначениеИзСтрокиВнутр(СтрокаНастройки);
		ТекстовыйДокумент = Неопределено;
		УдалитьФайлы(ИмяВременногоФайла);
		// --- 
		НастройкаОбъект = Объект.Ссылка.ПолучитьОбъект();
		НастройкаОбъект.Настройка = Новый ХранилищеЗначения(СтруктураНастройки);
		НастройкаОбъект.Записать();
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
		
	// --- 
КонецФункции

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
